docs: change from ASCII to mermaid charts
docs: change from ASCII to mermaid charts
